CSI API ETABS v1
cDetailing.GetSimilarBeamLines Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetSimilarBeamLines(
	string BeamLineID,
	ref int NumberSimilarBeams,
	ref int[] NumberUniqueObjects,
	ref string[] ObjectUniqueNames
)
Function GetSimilarBeamLines (
	BeamLineID As String,
	ByRef NumberSimilarBeams As Integer,
	ByRef NumberUniqueObjects As Integer(),
	ByRef ObjectUniqueNames As String()
) As Integer
Dim instance As cDetailing
Dim BeamLineID As String
Dim NumberSimilarBeams As Integer
Dim NumberUniqueObjects As Integer()
Dim ObjectUniqueNames As String()
Dim returnValue As Integer
returnValue = instance.GetSimilarBeamLines(BeamLineID,
	NumberSimilarBeams, NumberUniqueObjects,
	ObjectUniqueNames)
int GetSimilarBeamLines(
	String^ BeamLineID,
	int% NumberSimilarBeams,
	array<int>^% NumberUniqueObjects,
	array<String^>^% ObjectUniqueNames
)
abstract GetSimilarBeamLines :
        BeamLineID : string *
        NumberSimilarBeams : int byref *
        NumberUniqueObjects : int[] byref *
        ObjectUniqueNames : string[] byref -> int
Parameters
BeamLineID
Type: System.String
NumberSimilarBeams
Type: System.Int32
NumberUniqueObjects
Type: System.Int32[]
ObjectUniqueNames
Type: System.String[]
Return Value
Type: Int32
See Also
Reference
cDetailing Interface
ETABSv1 Namespace